easymall/controllers/FooterController.php

    public function actionData()
    {
        $query = Footer::find();
        $pager = $this->setPager($query, 'footer/data');
        $footerInfo = $query->offset($pager->offset)->limit($pager->limit)->asArray()->all();
---
SELECT * FROM `footer` LIMIT 13