easymall/controllers/GoodsController.php

    public function actionData($good_name = '', $type = '')
    {
        $query = Goods::find()->filterWhere(['good_name'=>$good_name])->filterWhere(['good_type'=>$type]);
        $goodType = GoodsType::find()->select('id,type')->asArray()->all();
        $pager = $this->setPager($query, 'goods-label/data');
        $goodsInfo = $query->offset($pager->offset)->limit($pager->limit)->asArray()->all();
---
SELECT `id`, `type` FROM `goods_type`
SELECT * FROM `goods` LIMIT 13

    public function actionAddGood()
    {
        //获取商品的类型
        $typeInfo = GoodsType::find()->select('id,type')->asArray()->all();
        $typeInfo and $typeInfo = array_column($typeInfo, 'type', 'id') or $typeInfo = [];
        //获取商品的供应商
        $supplierInfo = Supplier::find()->select('id,supplier_name')->asArray()->all();
---
SELECT `id`, `type` FROM `goods_type`
SELECT `id`, `supplier_name` FROM `supplier`