easymall/controllers/GoodsLabelController.php

    public function actionData()
    {
        $query = GoodsLabel::find();
        $pager = $this->Pager($query,'goods-label/data');
        $labelInfo = $query->offset($pager->offset)->limit($pager->limit)->asArray()->all();
---
SELECT * FROM `goods_label` LIMIT 13