easymall/controllers/GoodTypeController.php

SELECT * FROM `goods_type` LIMIT 13
---
    public function actionData($typename = '')
    {
        $query = GoodsType::find();
        $pager = $this->Pager($query,'goods-type/data');
        $typeInfo = $query->offset($pager->offset)->limit($pager->limit)->filterWhere(['type' => $typename])->asArray()->all();