easymall/controllers/HomeController.php

    public function actionIndex()
    {
        //登陆用户信息
        $user_id = Yii::$app->user->id;
        $userInfo = Operators::find()->where(['id'=>$user_id])->one();
---
SELECT * FROM `operators` WHERE `id`=1