easymall/controllers/OperatorsController.php

    public function actionData($operator_name = '')
    {
        //获取管理员及关联管理员的信息
        $query = Operators::find()->joinWith('operatorinfos')->filterWhere(['like', 'operator_name', $operator_name]);
        $pager = $this->Pager($query,'operators/data');
        $OperatorsInfos = $query->offset($pager->offset)->limit($pager->limit)->asArray()->all();
---
SELECT `operators`.* FROM `operators` LEFT JOIN `operators_info` ON `operators`.`id` = `operators_info`.`operator_id` LIMIT 13

    public function actionUpdate($operator_id='')
    {
        $operator = Operators::findOne(['id'=>$operator_id]);
        $operator_info = OperatorsInfo::findOne(['operator_id'=>$operator_id]);
---
SELECT * FROM `operators` WHERE `id`='20'
SELECT * FROM `operators_info` WHERE `operator_id`='20'