easymall/controllers/RoleController.php

SELECT * FROM `auth_item` WHERE `type`=1
---
    public function actionIndex()
    {
        $command = AuthItem::find()->where(['type'=>1])->all();