easymall/controllers/SupplierController.php

SELECT * FROM `supplier` WHERE `id`='1'
---
    public function actionData()
    {
        $query = Supplier::find();
        $pager = $this->Pager($query,'supplier/data');
        $supplierInfo = $query->offset($pager->offset)->limit($pager->limit)->asArray()->all();