easymall/controllers/UserController.php

SELECT * FROM `user` LIMIT 13
---
    public function actionData()
    {
        $query = User::find();
        $pager = $this->Pager($query, 'user/data');
        $userInfo = $query->offset($pager->offset)->limit($pager->limit)->asArray()->all();