easymall/models/GoodsType.php

    public static function getPic($result)
    {
        if (!$result) return [];
        foreach ($result as $k=>&$v){
            $v['logo'] = Pictures::find()->where(['id'=>$v['logo_id']])->asArray()->one();
---
SELECT * FROM `pictures` WHERE `id`='6'