easymall/models/Operators.php

SELECT * FROM `operators` WHERE `id`=1
---
    public function comparePwd($attr, $params)
    {
        $sys = Operators::findOne(Yii::$app->session['id']);

SELECT * FROM `operators` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        $user = Operators::find()->where(['id' => $id])->one();

SELECT `name`, `type` FROM `auth_item` WHERE `type`=1
---
    public function getRoles()
    {
        $query = (new \yii\db\Query())
            ->select(['name', 'type'])
            ->from("auth_item")->andWhere(['type' => 1]);
        return $query->all();